In [1]:
import pandas as pd

In [42]:
x = ('split').split(sep=None)
x

['split']

In [38]:
a = pd.DataFrame({'a':[1,2,3,4,5],
                  'b':[0,7,4,5,6],
                  'c':x})

In [39]:
a

   a  b  c
0  1  0  s
1  2  7  p
2  3  4  l
3  4  5  i
4  5  6  t

In [6]:
a. index = ['R','U','G','V','E']

In [8]:
a.columns= ['c1','c2','c3']

In [21]:
a.reset_index()

  index  c1  c2  c3
0     R   1   0   2
1     U   2   7   6
2     G   3   4   3
3     V   4   5   9
4     E   5   6   2

In [20]:
a.set_index('c1')

    c2  c3
c1
1    0   2
2    7   6
3    4   3
4    5   9
5    6   2

In [22]:
a.c1

R    1
U    2
G    3
V    4
E    5
Name: c1, dtype: int64

In [44]:
a

   a  b  c
0  1  0  s
1  2  7  p
2  3  4  l
3  4  5  i
4  5  6  t

In [48]:
a.iloc[0:3,[1,2]]

   b  c
0  0  s
1  7  p
2  4  l

In [49]:
a.loc[[0,1],['a','b']]

   a  b
0  1  0
1  2  7

In [55]:
a['a*b']=None

In [56]:
a

   a  b  c   a*b
0  1  0  s  None
1  2  7  p  None
2  3  4  l  None
3  4  5  i  None
4  5  6  t  None

In [52]:
a.drop(4)

   a  b  c  a*b
0  1  0  s    0
1  2  7  p   14
2  3  4  l   12
3  4  5  i   20

In [58]:
a.isna().sum()

a      0
b      0
c      0
a*b    5
dtype: int64

In [59]:
a

   a  b  c   a*b
0  1  0  s  None
1  2  7  p  None
2  3  4  l  None
3  4  5  i  None
4  5  6  t  None

In [70]:
a[a['a']>2][['a','b']]

   a  b
2  3  4
3  4  5
4  5  6

In [71]:
def app(a):
    return a*10

In [72]:
a.apply(app)

    a   b           c  a*b
0  10   0  ssssssssss  NaN
1  20  70  pppppppppp  NaN
2  30  40  llllllllll  NaN
3  40  50  iiiiiiiiii  NaN
4  50  60  tttttttttt  NaN

In [75]:
ser = a['a']

In [78]:
x = {'a':20,'b':30,'c':'sadsa','a*b':30}

In [80]:
x = pd.DataFrame(a+x)

In [83]:
x

    a   b       c  a*b
0  21  30  ssadsa  NaN
1  22  37  psadsa  NaN
2  23  34  lsadsa  NaN
3  24  35  isadsa  NaN
4  25  36  tsadsa  NaN

   a  b  c
0  1  0  s
1  2  7  p
2  3  4  l
3  4  5  i
4  5  6  t

In [87]:
import numpy as np

In [97]:
x = pd.DataFrame({
    'a':[1,2,5,np.nan,6],
    'b':[np.nan,np.nan,5,1,6],
    'c':[1,2,5,np.nan,6],
    'd':[1,2,np.nan,7,6],
    'e':[1,2,5,2,np.nan]
})

In [99]:
x

     a    b    c    d    e
0  1.0  NaN  1.0  1.0  1.0
1  2.0  NaN  2.0  2.0  2.0
2  5.0  5.0  5.0  NaN  5.0
3  NaN  1.0  NaN  7.0  2.0
4  6.0  6.0  6.0  6.0  NaN

In [107]:
x.dropna(thresh=4,axis=1)

     a    c    d    e
0  1.0  1.0  1.0  1.0
1  2.0  2.0  2.0  2.0
2  5.0  5.0  NaN  5.0
3  NaN  NaN  7.0  2.0
4  6.0  6.0  6.0  NaN

In [114]:
x.mean(axis=0)

a    3.5
b    4.0
c    3.5
d    4.0
e    2.5
dtype: float64

In [115]:
x.bfill(axis=1)

     a    b    c    d    e
0  1.0  1.0  1.0  1.0  1.0
1  2.0  2.0  2.0  2.0  2.0
2  5.0  5.0  5.0  5.0  5.0
3  1.0  1.0  7.0  7.0  2.0
4  6.0  6.0  6.0  6.0  NaN

In [120]:
x.backfill((x.mean(axis=1)))

TypeError: NDFrame.backfill() takes 1 positional argument but 2 were given

In [121]:
x

     a    b    c    d    e
0  1.0  NaN  1.0  1.0  1.0
1  2.0  NaN  2.0  2.0  2.0
2  5.0  5.0  5.0  NaN  5.0
3  NaN  1.0  NaN  7.0  2.0
4  6.0  6.0  6.0  6.0  NaN

In [127]:
c = x.bfill(axis=1)
c

     a    b    c    d    e
0  1.0  1.0  1.0  1.0  1.0
1  2.0  2.0  2.0  2.0  2.0
2  5.0  5.0  5.0  5.0  5.0
3  1.0  1.0  7.0  7.0  2.0
4  6.0  6.0  6.0  6.0  NaN

In [128]:
c.groupby('a')['c'].sum()

a
1.0    8.0
2.0    2.0
5.0    5.0
6.0    6.0
Name: c, dtype: float64

In [1]:
type(c)

NameError: name 'c' is not defined